{
    "Enrique Hernandez, Jr." : {
        "id" : "Enrique Hernandez, Jr.",
        "name" : "Enrique Hernandez, Jr.",
        "description" : "Mr. Hernandez was elected Non-Executive Chairman of McDonald’s Corporation in 2016. He has served on the Board as an independent director since 1996 and previously chaired the Audit Committee. Mr. Hernandez is Executive Chairman of Inter-Con Security Systems, Inc., a provider of security services to corporations, governments, diplomatic missions and non-profit organizations. Mr. Hernandez previously served as Chairman and Chief Executive Officer of Inter-Con Security Systems, Inc. from 1986 to 2021. Mr. Hernandez also serves as director of Chevron Corporation. Mr. Hernandez earned a bachelor's degree in government and economics from Harvard University and received his law degree from The Harvard Law School.",
        "image" : "EnriqueHernandez"
    },
    
    "Lloyd H. Dean" : {
        "id" : "Lloyd H. Dean",
        "name" : "Lloyd H. Dean",
        "description" : "Chief Executive Officer of CommonSpirit Health, a non-profit, Catholic health system, since 2019. Mr. Dean previously served as President and Chief Executive Officer of Dignity Health, one of the nation’s largest healthcare systems, from 2000 to 2019. Prior to joining Dignity, Mr. Dean was Chief Operating Officer at Advocate Health Care. Mr. Dean also serves as director of Golden Arrow Merger Corp. Director since 2015.",
        "image" : "EnriqueHernandez"
    },
    "Robert A. Eckert" : {
        "id" : "Robert A. Eckert",
        "name" : "Robert A. Eckert",
        "description" : "Operating Partner of FFL Partners, LLC, a private equity firm, since 2014. Mr. Eckert is also Chairman Emeritus of Mattel, Inc., a role he has held since 2013. He was Mattel’s Chairman and Chief Executive Officer from 2000 until 2011, and he continued to serve as its Chairman until 2012 Mr. Eckert also serves as Chair of the Board of Levi Strauss & Co., as well as lead independent director of Amgen Inc., and as director of Uber Technologies, Inc. Director since 2003.",
        "image" : "EnriqueHernandez"
    },
    "Catherine M. Engelbert" : {
        "id" : "Catherine M. Engelbert",
        "name" : "Catherine M. Engelbert",
        "description" : "Commissioner of the Women’s National Basketball Association, a professional sports league, a position she has held since 2019. Ms. Engelbert served as Chief Executive Officer of Deloitte, an industry-leading audit, consulting, tax and advisory services firm, from 2015 to 2019, as Chairman and Chief Executive Officer of Deloitte & Touche LLP, an audit subsidiary of Deloitte LLP, from 2014 to 2015, as partner of Deloitte & Touche LLP from 1998 to 2019, and in other senior positions at Deloitte since joining in 1986. Ms. Engelbert also serves as director of Royalty Pharma plc. Director since 2019.",
        "image" : "EnriqueHernandez"
    },


    "Margaret H. Georgiadis" : {
        "id" : "Margaret H. Georgiadis",
        "name" : "Margaret H. Georgiadis",
        "description" : "Endurance Partner-In-Residence (XIR) at General Catalyst, a venture capital firm, and Managing Partner at Synetro Group, a private investment and strategic advisory firm, since early 2021. Ms. Georgiadis previously served as President and Chief Executive Officer of Ancestry, a global family history and consumer genomics company, from 2018 to 2020. Ms. Georgiadis served as Chief Executive Officer at Mattel, Inc., a leading global toy company and entertainment franchise, from 2017 to 2018. Ms. Georgiadis also served as President, Americas at Google Inc., a global technology company, from 2011 to 2017, and Vice President, Global Sales Operations at Google from 2009 to 2011. Ms. Georgiadis also serves as director of AppLovin Corporation. Director since 2015.",
        "image" : "EnriqueHernandez"
    },

    "Chris Kempczinski" : {
        "id" : "Chris Kempczinski",
        "name" : "Chris Kempczinski",
        "description" : "Chris Kempczinski is President and Chief Executive Officer of McDonald’s, the world’s leading global foodservice retailer with nearly 40,000 locations in over 100 countries. He previously served as President of McDonald’s USA from 2017 to 2019, where he was responsible for the business operations of approximately 14,000 McDonald’s restaurants in the United States. He first joined McDonald’s in 2015 as Executive Vice President – Strategy, Business Development and Innovation. In that role, he served the business units and franchisees by identifying new ideas and best practices to accelerate their growth and grow the overall value of the system. Before joining McDonald’s, Chris was Executive Vice President of growth initiatives and President of Kraft International. Mr. Kempczinski also serves as director of The Procter & Gamble Company. Director since 2019.",
        "image" : "EnriqueHernandez"
    },

    "Richard H. Lenny" : {
        "id" : "Richard H. Lenny",
        "name" : "Richard H. Lenny",
        "description" : "Non-executive Chairman of Conagra Brands, Inc., a leading branded food company, since 2018 and director since 2009. Mr. Lenny previously served as Non-executive Chairman of Information Resources, Inc., a market research firm from 2013 to 2018. Operating Partner of FFL Partners, LLC, a private equity firm, from 2011 to 2014, and senior advisor from 2014 to 2016.  Mr. Lenny also served as Chairman, President and Chief Executive Officer of The Hershey Company, an industry-leading snacks company, from 2001 until 2007. Mr. Lenny also serves as independent lead director of Illinois Tool Works Inc. Director since 2005.",
        "image" : "EnriqueHernandez"
    },

    "John J. Mulligan" : {
        "id" : "John J. Mulligan",
        "name" : "John J. Mulligan",
        "description" : "Executive Vice President and Chief Operating Officer of Target Corporation, a general merchandise retailer that operates in the U.S., since 2015. From 2012 to 2015, Mr. Mulligan served as Executive Vice President and Chief Financial Officer of Target. While continuing to act as CFO, Mr. Mulligan also served as Interim President and Chief Executive Officer of Target during 2014. Prior to that time, Mr. Mulligan served as Senior Vice President, Treasury, Accounting and Operations of Target from 2010 to 2012. Director since 2015.",
        "image" : "EnriqueHernandez"
    }
}
